import matplotlib.pyplot as plt
import matplotlib as mpl

dit = {'蔬菜': [1350, 1500, 1330, 1550, 900, 1400, 980, 1100, 1370, 1250, 1000, 1100],
       '水果': [400, 600, 580, 620, 700, 650, 860, 900, 880, 900, 600, 600],
       '肉类': [480, 700, 370, 440, 500, 400, 360, 380, 480, 600, 600, 400],
       '日用': [1100, 1400, 1040, 1300, 1200, 1300, 1000, 1200, 950, 1000, 900, 950],
       '衣服': [650, 3500, 0, 300, 300, 3000, 1400, 500, 800, 2000, 0, 0],
       '旅游': [4000, 1800, 0, 0, 0, 0, 0, 4000, 0, 0, 0, 0],
       '随礼': [0, 4000, 0, 600, 0, 1000, 600, 1800, 800, 0, 0, 1000]}
for cate, data in dit.items():  # 将每类花销汇总
    dit[cate] = sum(data)
# 绘制饼状图
plt.pie(list(dit.values()),  # 每个扇形对应的数值
        labels=list(dit.keys()),  # 每个扇形的标签
        autopct='%1.1f%%')  # 数据百分比显示格式
plt.title("此家庭全年在各个类别花销情况饼状图")  # 设置饼状图的标题
# 设置中文字体显示
mpl.rcParams["font.sans-serif"] = ["Microsoft YaHei"]
mpl.rcParams["axes.unicode_minus"] = False
# 展示饼状图
plt.show()
